[
    {
        "title": "OMA San Isidro", 
        "skills": ["Nextjs","Sass","git"], 
        "description": "I was in charge of the front-end for this project. I replicated every single page from a figma design provided by the designer. This is a full in-production site created for the San Isidro math olympics. The creator of the repository, Julian Zylber, was the leader of the project and the one who very kindly taught me git (he is literally a teacher). I enjoyed this one because I got the chance to work with real developers. This project was also my first approach to Sass, which I later used for the Crypto Dashboard and other stuff. Honestly it was fun to work in a team and be part of something bigger. Looking foward for similar projects. ",
        "link":"https://www.omasanisidro.org.ar/" , 
        "github": "https://github.com/JZylber/oma-san-isidro" , 
        "impo": 4,
        "preview": "/oma-preview.webp"
    },
    {
        "title": "Nit Charge", 
        "skills": ["Gatsby","SASS","React","Typescript"],
        "description": "I took on an exciting challenge with a startup, where I rapidly designed, coded, and optimized their website on the go. In just two weeks, we managed to deploy the site, and it's currently making great progress. I'm thrilled to share that the website has received a perfect 100 score on Google's Lighthouse Report, reflecting its outstanding performance.",
        "link": "https://nitcharge.com/", 
        "github": "", 
        "impo": 1,
        "preview": "/nit-preview.webp"
    },
    {
        "title": "Evernote Clone", 
        "skills": ["Nextjs","Tailwindcss","Firebase","Typescript"],
        "description": "The sole purpose of this project was to learn with Firebase and Nextjs dynamic pages API. It started as a to-do list but I was seeing that literally everywhere so I decided to take a different aproach. Of course creating a Twitter crossed my mind, but actually I am jealous of mac users that have an actual notepad on the computer and do not need a third party app. Anyways, this project took me almost 1 week and a half and it's missing some functionalities such as sorting the notes and being able to add them styles. But we'll get to that. The purpose was achieved. I learned Authentication and Firestore and that's a neat first aproach to databases. Next step is learning SQL.",
        "link": "https://evernote-clone-five.vercel.app/", 
        "github": "https://github.com/reymondar/evernote-clone", 
        "impo": 1,
        "preview": "/evernote-preview.webp"
    },
    {
    "title": "Crypto Dashboard", 
    "skills": ["Next.js" , "Sass" , "react-query" , "Typescript","Chartjs"], 
    "description": "I was intreseted in learning more about working with API's, using react-query and Next.js. I created this project on Next.js (typescript). I started by installing a popular library called Chartjs and react-chartjs-2 to create the graphs. Then react-query to manage api responses and Sass for the styling. With this project I learned a lot, particullary refactoring. From Js to Ts, fixing all type of bugs and much more. Of course there is still some refactor to make, like the responsiveness a bit (although it's a desktop dashboard).",
    "link":"https://crypto-dashboard-reymondar.vercel.app/" ,
    "github": "https://github.com/reymondar/crypto-dashboard" ,
    "impo": 3,
    "preview": "/crypto-preview.webp"
},
    {
    "title": "Entertainment Web App", 
    "skills": ["Gatsby","SASS","GraphQL","Typescript"],
    "description": "This projects has two sides. The first one is the pixel-perfect css design to the figma document. It's responsive and includes a login page in which you can save your favorites movies. The second side, is the usage of The Movie Data Base API used with Graphql to make static Queries." , 
    "link":"https://entertainment-app-reymondar.vercel.app/" , 
    "github": "https://github.com/reymondar/entertainment-app" , 
    "impo": 2,
    "preview": "/entretainment-preview.webp"
},
{
        "title": "Planets Fact Size", 
        "skills": ["React","CSS","Javascript"], 
        "description": "So for this project I used Frontend.io Json file to pull the info. This was pretty neat since my major concern when I grabbed this one project was how to create one single component for every planet. Responsiveness was the hardest part since I wanted to avoid using libraries or custom hooks created by others than me. In conclusion it was a great project to get going with the basics after so much challenges, courses, vacations and work interferences. This is my first trully project uploaded to github, probably I will upload my vanilla JS games one day but for now I am good :).",
        "link":"https://planets-facts-size.vercel.app/" , 
        "github": "https://github.com/reymondar/planets-facts-size" , 
        "impo": 4,
        "preview": "/planets-preview.webp"
},
{
    "title": "Personal Portfolio", 
    "skills": ["Nextjs","Tailwind"], 
    "description": "This website! Why did I include this website in my projects? Good question. It turns out that this was going to be a simple website where I would showcase my projects and a bit about myself (Hopefully enough). I made a first sketch on paper for this website, and started programming it. Then, wanting to include features like scroll effects, I realized that I hadn't delved deep enough into some more advanced applications of CSS with React, so I delved into learning about different libraries and the uses of one of React's most basic hooks: useEffect. This portfolio is created in Tailwind because I didn't care too much about how the portfolio looks visually, but I am obstinate and feel that I could add a thousand more things to my own website. Thanks for reading this. Regards.",
    "link":"https://planets-facts-size.vercel.app/" , 
    "github": "https://github.com/reymondar/personal-portfolio" , 
    "impo": 4,
    "preview": "/portfolio-preview.webp"
}
]
