[
    {
        "title": "Evernote Clone", 
        "skills": ["Nextjs","Tailwindcss","Firebase","Typescript"],
        "description": "The sole purpose of this project was to learn with Firebase and Nextjs dynamic pages API. It started as a to-do list but I was seeing that literally everywhere so I decided to take a different aproach. Of course creating a Twitter crossed my mind, but actually I am jealous of mac users that have an actual notepad on the computer and do not need a third party app. Anyways, this project took me almost 1 week and a half and it's missing some functionalities such as sorting the notes and being able to add them styles. But we'll get to that. The purpose was achieved. I learned Authentication and Firestore and that's a neat first aproach to databases. Next step is learning SQL.",
        "link": "https://evernote-clone-five.vercel.app/", 
        "github": "https://github.com/reymondar/evernote-clone", 
        "impo": 1,
        "preview": "/evernote-preview.png"
    },
    {
    "title": "Crypto Dashboard", 
    "skills": ["Next.js" , "Sass" , "react-query" , "Typescript","Chartjs"], 
    "description": "I was intreseted in learning more about working with API's, using react-query and Next.js. I created this project on Next.js (typescript). I started by installing a popular library called Chartjs and react-chartjs-2 to create the graphs. Then react-query to manage api responses and Sass for the styling. I learned so much so much. More than with any other project or course I created because I (or at least tried to) optimized every aspect on the fly. Of course there is still some refactor to make, like the responsiveness and typescript errors but other than that I used a ton of react tools to make this app flyy..",
    "link":"" ,
    "github": "https://github.com/reymondar/crypto-dashboard" ,
    "impo": 2,
    "preview": "/crypto-preview.png"
},
    {
    "title": "KanBan app", 
    "skills": ["Gatsby","Tailwindcss","GraphQL","Typescript"],
    "description": "This is a kanban app where you can add boards and tasks. Basically, the project consists of using beautiful dnd and a JSON file to store all the information. The initial idea behind this project was to learn GatsbyJS and GraphQL. The problem I encountered when I started this project was trying to learn lots of things at once. On the one hand, the framework itself, Tailwind, and on the other hand, GraphQL, which set me back a lot as it was a bit stressful. I learned a lot about GatsbyJS as I built the app, and at some point, I would like to create my own ecommerce and blog templates to monetize them. I must continue learning GraphQL as it seems to be a great tool and probably one of the best out there." , 
    "link":"https://kanbanappmain.gatsbyjs.io/" , 
    "github": "https://github.com/reymondar/kanban-app" , 
    "impo": 3,
    "preview": "/kanban-preview.png"
},
{
        "title": "Planets Fact Size", 
        "skills": ["React","CSS","Javascript"], 
        "description": "So for this project I used Frontend.io Json file to pull the info. This was pretty neat since my major concern when I grabbed this one project was how to create one single component for every planet. Responsiveness was the hardest part since I wanted to avoid using libraries or custom hooks created by others than me. In conclusion it was a great project to get going with the basics after so much challenges, courses, vacations and work interferences. This is my first trully project uploaded to github, probably I will upload my vanilla JS games one day but for now I am good :).",
        "link":"https://planets-facts-size.vercel.app/" , 
        "github": "https://github.com/reymondar/planets-facts-size" , 
        "impo": 4,
        "preview": "/planets-preview.png"
},
{
    "title": "Personal Portfolio", 
    "skills": ["Nextjs","Tailwind"], 
    "description": "This website! Why did I include this website in my projects? Good question. It turns out that this was going to be a simple website where I would showcase my projects and a bit about myself (Hopefully enough). I made a first sketch on paper for this website, and started programming it. Then, wanting to include features like scroll effects, I realized that I hadn't delved deep enough into some more advanced applications of CSS with React, so I delved into learning about different libraries and the uses of one of React's most basic hooks: useEffect. This portfolio is created in Tailwind because I didn't care too much about how the portfolio looks visually, but I am obstinate and feel that I could add a thousand more things to my own website. Thanks for reading this. Regards.",
    "link":"https://planets-facts-size.vercel.app/" , 
    "github": "https://github.com/reymondar/planets-facts-size" , 
    "impo": 4,
    "preview": "/portfolio-preview"
}

]
